<?php $this->pageTitle='Срок доступа истёк' ?>

<div class="wrap">

    <h3>Закрытая зона</h3>

    <h1>Срок доступа к Закрытой Зоне окончен</h1>

    <div align="center">
    <img style="margin:3px;" src="<?= Y::bu() ?>images/front/area/noaccess.png" />

    <p>К сожалению, оплаченный Вами срок доступа к Закрытой Зоне <b>истёк</b>.</p>
    <br>
    <p>Вы можете продлить доступ используя форму выше.</p>
    <br>
    <p>После продления, для активации оплаченного срока - выйдите из Закрытой Зоны<br> и выполните новый вход</p>
    </div>

</div>