<?php

// Файл перевода для Order Master Pro
//
// Для редактирования меняйте ВТОРУЮ часть (которая после => в кавычках)!!
// Например, если нужно перевести слово "Имя" на английский язык
// То меняем строчку на такую:
// 'Имя' => 'Name',


return array(

  //Модель "Счет"

  'Дата создания' => 'Дата создания',
  'Сумма' => 'Сумма',
  'Валюта' => 'Валюта',
  'Курс USD' => 'Курс USD',
  'Курс EUR' => 'Курс EUR',
  'Курс UAH' => 'Курс UAH',
  'Купон скидки' => 'Купон скидки',
  'Дата оплаты' => 'Дата оплаты',
  'Статус' => 'Статус',
  'E-mail' => 'E-mail',
  'Другой E-mail' => 'Другой E-mail',
  'Имя' => 'Имя',
  'Фамилия' => 'Фамилия',
  'Отчество' => 'Отчество',
  'Страна' => 'Страна',
  'Область' => 'Область',
  'Город' => 'Город',
  'Почтовый индекс' => 'Почтовый индекс',
  'Адрес' => 'Адрес',
  'Телефон' => 'Телефон',
  'Комментарий к заказу' => 'Комментарий к заказу',
  'IP' => 'IP',
  'Способ оплаты' => 'Способ оплаты',
  'Номер посылки' => 'Номер посылки',
  'Тип заказа' => 'Тип заказа',
  'Заказов' => 'Заказов',
  'Получил напоминаний' => 'Получил напоминаний',


);