<?php

/**
 * Класс, генерирующий массив стран
 *
 * @version $Id$
 * @copyright 2010
 */

class Country {

	public static function get () {

		$a = array (

	"Россия", "Украина", "Австралия","Австрия","Азербайджан","Албания","Алжир","Американское Самоа","Ангилья (Брит.)",
	"Ангола","Андорра","Антигуа и Барбуда","Аргентина","Армения","Аруба (Нид.)","Афганистан","Багамы",
	"Бангладеш","Барбадос","Бахрейн","Беларусь","Белиз","Бельгия","Бенин","Бермуды (Брит.)","Болгария",
	"Боливия","Босния и Герцеговина","Ботсвана","Бразилия","Британская территория в Индийском океане",
	"Бруней-Даруссалам","Буркина-Фасо","Бурунди","Бутан","Вануату","Ватикан","Великобритания","Венгрия",
	"Венесуэла","Виргинские острова (Брит.)","Виргинские острова (США)","Вьетнам","Габон","Гаити","Гайана"
	,"Гамбия","Гана","Гваделупа (Фр.)","Гватемала","Гвинея","Гвинея-Бисау","Германия","Гернси (Брит.)",
	"Гибралтар (Брит.)","Гондурас","Гренада","Гренландия (Дат.)","Греция","Грузия","Гуам (США)","Дания",
	"Джерси (Брит.)","Джибути","Доминика","Доминиканская Республика","Египет","Замбия","Зап. Сахара",
	"Зимбабве","Израиль","Индия","Индонезия","Иордания","Ирак","Иран","Ирландия","Исландия","Испания",
	"Италия","Йемен","Кабо-Верде","Казахстан","Камбоджа","Камерун","Канада","Катар","Кения","Кипр",
	"Киргизия (Кыргызстан)","Кирибати","Китай","Кокосовые острова (Австр.)","Колумбия","Коморы",
	"Конго (Заир)","Конго, Республика","Корея (КНДР)","Корея, Республика","Коста-Рика","Кот-д`Ивуар",
	"Куба","Кувейт","Лаос","Латвия","Лесото","Либерия","Ливан","Ливия","Литва","Лихтенштейн","Люксембург",
	"Маврикий","Мавритания","Мадагаскар","Майотт (Фр.)","Македония","Малави","Малайзия","Мали","Мальдивы",
	"Мальта","Марокко","Мартиника (Фр.)","Маршалловы Острова","Мексика",
	"Микронезия (Федеративные Штаты Микронезии)","Мозамбик","Молдавия","Монако","Монголия",
	"Монтсеррат (Брит)","Мьянма","Намибия","Науру","Непал","Нигер","Нигерия","Нидерландские Антилы",
	"Нидерланды","Никарагуа","Ниуэ (Н.Зел.)","Новая Зеландия","Новая Каледония (Фр.)","Норвегия",
	"Объединенные Арабские Эмираты","Оман","Остров Буве (Норв.)","Остров Кайман (Брит.)",
	"Остров Мэн (Брит.)","Остров Рождества (Австр.)","Острова Кука (Н.Зел.)",
	"Острова Теркс и Кайкос (Брит.)","Острова Херд и Макдональд (Австр.)","Пакистан","Палау","Палестина",
	"Панама","Папуа - Новая Гвинея","Парагвай","Перу","Питкерн (Брит.)","Польша","Португалия",
	"Реюньон (Фр.)","Руанда","Румыния","США","Сальвадор","Самоа","Сан-Марино","Сан-Томе и Принсипи",
	"Саудовская Аравия","Свазиленд","Святая Елена (Брит.)","Сев. Марианские острова (США)","Сейшелы",
	"Сенегал","Сент-Винсент и Гренадины","Сент-Китс и Невис","Сент-Люсия","Сент-Пьер и Микелон (Фр.)",
	"Сербия","Сингапур","Сирия","Словакия","Словения","Соломоновы Острова","Сомали","Судан","Суринам",
	"Сьерра-Леоне","Таджикистан","Таиланд","Тайвань","Танзания","Тимор","Того","Токелау (Н.Зел.)","Тонга",
	"Тринидат и Тобаго","Тувалу","Тунис","Туркмения","Турция","Уганда","Узбекистан",
	"Уоллис и Футуна острова (Фр.)","Уругвай","Фарерские о-ва (Дания)","Фиджи","Филиппины","Финляндия",
	"Фолклендские острова (Брит.)","Франция","Французская Гвиана","Французская Полинезия",
	"Французские Южные территории","Хорватия","Центральноафриканская Республика","Чад","Черногория",
	"Чехия","Чили","Швейцария","Швеция","Шпицберген (Норв.)","Шри Ланка","Эквадор",
	"Экваториальная Гвинея","Эритрея","Эстония","Эфиопия","Юж. Джорджия и Юж. Сандвичевы о-ва (Брит.)",
	"Южно-Африканская Республика (ЮАР)","Ямайка","Япония"

		);

		$b = array ();

		foreach ($a as $one) {
			$b[$one] = $one;
		}

		return $b;

	}

}

?>